[
{"url": "https://bangbros.com/video/9519051/the-time-for-ass-is-ny", "title": "The Time For Ass Is Ny", "release_date": "November 20, 2023", "performers": "Connie Perignon, Ny Ny Lew, Jovan Jordan", "synopsis": "I just had to show Jovan our new neighbors; Connie and Ny Ny. They are always in their backyard by the pool just oiling and lotioning, lotioning and oiling. It became to much. So I snuck him in their backyard so he can join in my agony. But Jovan being a giant got us busted. Luckily for us they are pretty cool and put on a show for us. They got naked and continued to oil and tease us with those juicy booties. Until Jovan thought it was an invitation to get naked with them. As soon as they saw how blessed Jovan was, they needed his dick in them asap. They sucked it together good, and when it was time to fuck he stretched Ny Ny to her capacity. But Connie was his kryptonite, all he could do was edge with her until he couldn't take it anymore and unloaded on both their faces. They let us know we could come over anytime and we no longer had to creep out on them. What good neighbors they are.", "tags": "Average Male Body ;Black Male;Short Hair;Big Dick;Bikini;Fishnet;Big Ass;Bubble Butt;Piercing;Tattoo;Thick;Voluptuous;Asian;Black Hair;Bald Pussy;Innie Pussy;Big Tits;Enhanced;Black;Trimmed Pussy;Big Naturals;Big Boobs (Natural);Natural Tits;FFM;Sex;Threesome;Cum Shot;Cum Swap;Massage;Masturbation;Squirt;Twerking;Wet;Blowjob;Blowjob - Double;Face Sitting;Pussy Fingering;Pussy Licking;Spanking;Outdoors;Pool;Amateur;Ass Worship;Big Tits Worship;Interracial;Ass Stacking;Cowgirl;Doggystyle;Fuck n Lick;Oil;Outdoor Sex;4k", "sub_side": "Ass Parade"},
{"url": "https://bangbros.com/video/9496311/lets-play-a-dirty-game", "title": "Let's Play a dirty Game.", "release_date": "October 31, 2023", "performers": "Elana Bunnz, Johnny Love", "synopsis": "Elana Checks into her airbnb, but a crazed masked game master is trying to make sure she doesn't check out. He locks her in a room and gives her a choice, play with a dildo or else. She runs and fights off the masked man for dear life. But just like a white girl in a scary movie she falls, and he catches her. She removes his mask in a struggle, and it is revealed he is Johnny her ex boyfriend. She asks him why he would go to such lengths. He expresses to her that he misses her and just wanted to see her naked again. Elana is so turned on, she tells him all he had to do was ask. She gets completely naked and Johnny can't help but worship her huge tits and phat ass. She tells him he better fuck her like he missed her, and Johnny does just that. Pounding her like bongos and enjoying her voluptuous body. He unloads on her face and will always remember this as the best halloween he has ever had.", "tags": "Average Male Body ;Latin;Black Hair;Short Hair;Big Dick;Booty Shorts;Shorts;Tank Top;Big Ass;Bubble Butt;Woman (20-29);Piercing;Tattoo;Voluptuous;Caucasian;Blonde;Sandals;Teddy;Bald Pussy;Innie Pussy;Big Naturals;Big Tits;Big Boobs (Natural);Natural Tits;Sex;Cum Shot;Facial;Blowjob;Blowjob - POV;Pussy Fingering;Spanking;Titty Fuck;Tittyfuck - POV;Bedroom;Indoors;Amateur;Big Tits Worship;Interracial;Cowgirl;Doggystyle;Missionary;Reverse Cowgirl;Side Fuck;Dildo;Sex Toys;Halloween;4k", "sub_side": "Bangbros Clips"},
{"url": "https://bangbros.com/video/9491191/threesomes-sums-are-sweeter-than-candy", "title": "Threesomes sums Are Sweeter Than Candy", "release_date": "October 30, 2023", "performers": "Yum Thee Boss, Amirah Sky, Jovan Jordan", "synopsis": "You would think making porn on Halloween would be easy, but that is not the case. While trying to get the best angels of Yum Thee Boss phat ass booty, we keep getting interrupted by a knock on the door, by a relentless trick or treater Amirah. She even resorts to spying in the windows. Enough is enough, and we got porn to make. Javon goes to run her off but she refuses to leave without something sweet to put in her mouth. So Javon pulls out his big ass dick and lets her know this is the only chocolate bar we have in this house. Amirah lets him know that will do, as she shoves it in her mouth. Yum lets her know she has enough Chocolate ass for the needy as well. Then she sits on Amirah's face as she eats her ass. A wild 3sum breaks out as Javon fucks both of them and he make sure he opens up Amirah's tight pussy, giving her want she wanted and more. She begs him to drown her in his cum, I think she got a chocolate overload today.", "tags": "Average Male Body ;Black Male;Short Hair;Big Dick;Shorts;Sports Bra;Big Ass;Bubble Butt;Tattoo;Athletic;Black;Black Hair;Outie Pussy;Big Tits;Enhanced;Dress;Piercing;Caucasian;High Heels;Bald Pussy;Innie Pussy;FFM;Sex;Threesome;Cum Shot;Facial;Twerking;Wet;Ass Licking;Blowjob;Blowjob - Double;Deep Throat;Face Fuck;Face Sitting;Oral Train;Spanking;Indoors;Living Room;Amateur;Ass Worship;Big Tits Worship;69;Cowgirl;Doggystyle;Fuck n Lick;Side Fuck;Oil;Halloween;4k", "sub_side": "Ass Parade"},
{"url": "https://bangbros.com/video/9429111/maid-has-sex-temptations", "title": "Maid Has Sex Temptations", "release_date": "November 2, 2023", "performers": "Stefania Mafra, Jovan Jordan", "synopsis": "I wish I had Stefania Mafra as a maid. I'd pay her so much just to strut around and clean my house. Our boy Jovan is a lucky guy because he gets to see Stefania clean his house. She starts in the bathroom before he asks her to remove some clothes. No worries though as there's always cash invovled. Stefania couldn't say no to being tuipped well so she took her clothes off and kept cleaning. I love seeing her ass jiggle around as she's cleaning the shower and the bathtub. Jovan has her go to his room and that's when the real mischeviousness begins. She notices some cash before seeing Jovan straight up jacking off to her. Stefania wasn't prepared but she couldn't help but drool over that big dick. Catch Stefania Mafra play maid for a while before admiring her ass getting fucked by a big hard cock.", "tags": "Average Male Body ;Black Male;Big Dick;Booty Shorts;Tank Top;Big Ass;Bubble Butt;Woman (20-29);Piercing;Tattoo;Average Body;Brazilian;Latina;Brunette;Maid;Thong;Bald Pussy;Outie Pussy;Big Naturals;Big Tits;Big Boobs (Natural);Natural Tits;Sex;Cum Shot;Facial;Cleaning;Wet;Blowjob;Spanking;Bathtub;Bedroom;Indoors;Amateur;Interracial;Work Fantasies;Cowgirl;Doggystyle;Missionary;Oil;4k", "sub_side": "My Dirty Maid"},
{"url": "https://bangbros.com/video/9490621/angels-knockout-pussy", "title": "Angel's Knockout Pussy", "release_date": "October 27, 2023", "performers": "Kitana Montana, Johnny Love", "synopsis": "New Stepmom Kitana is dressed as a naughty angel and Johnny is in a hurry to get to the Halloween party. new stepmom wants to take pictures before leaving. Johnny is not having it, he's been waiting for too long. New Stepmom convinces him and takes pictures of her and then selfies. While taking selfies Johnny gets hard and new stepmom notices. This leads to new stepmom asking for a trade! She shows her the enormous and perfect big tits and he shows his huge dick. Quickly it goes into a wild sex session. Starting with new stepmom gagging on his dick and then Johnny bangs new stepmom from all positions leading to him cumming all over her pretty face.", "tags": "Average Male Body ;Latin;Black Hair;Short Hair;Stepson;Big Dick;Dress;Bubble Butt;Piercing;Tattoo;Athletic;Caucasian;Blonde;Stepmom;High Heels;Thong;Trimmed Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Blowjob;Blowjob - POV;Spanking;Indoors;Party;Amateur;Ass Worship;Big Tits Worship;cheating;Couples Fantasies;Interracial;Cowgirl;Doggystyle;Doggystyle - POV;Reverse Cowgirl;Side Fuck;Spoon;Stand And Carry;Halloween;4k", "sub_side": "MomIsHorny"},
{"url": "https://bangbros.com/video/9500441/iron-swinger-pussy", "title": null, "release_date": null, "performers": "", "synopsis": "The bus crew was driving around when they spotted Vanessa, a girl who seemed to be only muscle. She worked out 6 days a week to have a biceps like that. On top of that she and her husband were swingers! They lured her into the van to do some arm wrestling. She won and got $700. She had to get permission from her husband before she could show her breasts for $1000. And once her husband saw pictures of Jay Bangher’s dick, he didn’t mind that they fucked. So they fucked and sucked in all different positions until Jay shot his cum into her beautiful face and mouth.", "tags": "Tattoo;Muscular Man;Black Male;Long;Big Dick;Shorts;Sports Bra;Medium Ass;Athletic;Muscular;Caucasian;Black Hair;Swingers;Wife;Bald Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Blowjob;Blowjob - POV;Deep Throat;Car;Outdoors;Amateur;cheating;Couples Fantasies;Interracial;Cowgirl;Doggystyle;Missionary;Side Fuck;4k", "sub_side": "Bang Bus"},
{"url": "https://bangbros.com/video/9429171/puerto-rican-pussy-loves-oil", "title": "Puerto Rican Pussy Loves Oil", "release_date": "October 28, 2023", "performers": "Scarlett Venom, Jovan Jordan", "synopsis": "Scarlett Venom is hands down the best porn star I've ever laid my eyes on. Her natural tits hang perfectly and her ass is big and juicy. Her face is so gorgeous it makes me hard. We see her pool side enjoyhing the sun before we get her attention and have her strut her body in front of the camera. I'm so thankful for oil as we lather up her tits and ass all the way and she just squeezes and grabs herself. It's getting hot so we go inside for some more fun. The way she bends her legs up when she's laying down on her stomach....fuck, she makes me want to cum. You guys don't know what you're missing if you skip this because Scarlett is all about fucking hard and loud orgasms!", "tags": "Tattoo;Average Male Body ;Black Male;Black Hair;Short Hair;Big Dick;Bikini;Booty Shorts;Big Ass;Bubble Butt;Voluptuous;Latina;Red Head;Outie Pussy;Big Naturals;Big Tits;Big Boobs (Natural);Natural Tits;Sex;Cumshot Clean-Up;Cum Shot;Facial;Twerking;Wet;Blowjob;Blowjob - POV;Spanking;Titty Fuck;Tittyfuck - POV;Bedroom;Indoors;Outdoors;Pool;Amateur;Interracial;Cowgirl;Doggystyle;Missionary;Reverse Cowgirl;Side Fuck;Oil;4k", "sub_side": "Big Tits, Round Asses"},
{"url": "https://bangbros.com/video/9429071/monster-cock-stretches-yoga-instructor", "title": "Monster Cock Stretches Yoga Instructor", "release_date": "October 29, 2023", "performers": "Katalina Blue, Damion Dayski", "synopsis": "Damion had dreams of doing yoga and today those dreams are being realized only thing is his instructor Katalina Blue doesnt know how big of a dick he has and she is surely about to find out. When she does she tries to play it cool but the call of the huge cock was just to great of a call and she needed some to fill her tight little pussy needless to say Mr. Dayski stuffed her like a turkey and Katalina enjoyed every second of it.", "tags": "Piercing;Muscular Man;Black Male;Black Hair;Short Hair;Big Dick;Leggings;Sports Bra;Small Ass;Tattoo;Athletic;Caucasian;Blonde;Yoga;Trimmed Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Blowjob;Blowjob - POV;Deep Throat;Face Fuck;Gagging;Pussy Licking;Bathroom;Indoors;Outdoors;Amateur;Big Dick Worship;Big Tits Worship;Interracial;Cowgirl;Doggystyle;Doggystyle - POV;Reverse Cowgirl;Side Fuck;Spoon;4k", "sub_side": "Monsters of Cock"},
{"url": "https://bangbros.com/video/9450991/stepmoms-anal-reward", "title": "Stepmom's Anal Reward", "release_date": "November 3, 2023", "performers": "Alyssia Vera, Johnny Love", "synopsis": "Johnny is worried about his upcoming test. Stepmom promised she would let him fuck her in the ass if he passes the test. She notices how upset he is about it, she re-assures him that he will pass the test. Once he comes back from school he shows stepmom that he ace the test. She is so proud of him! As promised she gives Johnny her butthole for him to stick his dick in. First, she grabs some oil to prepare her litle hole. Johnny comes in and starts eating her out and from there he bangs her inisde the butthole from all posisions until he busts his huge load all over stepmoms face.", "tags": "Tank Top;Caucasian;Latin;Stepson;Bubble Butt;MILF;Athletic;Brunette;Stepmom;Sandals;Bald Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cum Shot;Facial;Masturbation;Anal Fingering;Ass Licking;Blowjob;Blowjob - POV;Deep Throat;Pussy Fingering;Pussy Licking;Indoors;Living Room;Amateur;Anal;Big Tits Worship;cheating;Couples Fantasies;Interracial;Cowgirl;Doggystyle;Doggystyle - POV;Missionary;Missionary - POV;Reverse Cowgirl;4k", "sub_side": "MomIsHorny"},
{"url": "https://bangbros.com/video/9483961/dear-god-its-me-brija", "title": "Dear God Its Me Brija", "release_date": "November 4, 2023", "performers": "Brija Monet, Jonathan Jordan", "synopsis": "Brija is at home putting in some me time; that what she calls her dildo. But it is just not satisfying her like a real dick would. She just can't help but call out her frustration in wanting a real dick. Almost prayer like oh god I need a real dick. Like a miracle there is a knock on the door, wont he do it? Jonathan is at the door and wonders if she has time to hear the good word. She is not interested in just words, faith without work is dead. Jonathan says is willing to do anything to help her, being just a humble servant. She quickly pulls him into the house, I mean he said anything. She pulls him into her gigantic breasts and lets him know the assignment. Jonathan knows a blessing when he sees one. She pulls out his bbc and she realizes Jonathan is the one who is blessed. They fuck like the old days with Brija's big beautiful tiddies bouncing everywhere. Jonathan has no choice but to cum in her. It's better your seed spill into the belly of a whore than on the floor.", "tags": "Muscular Man;Black Male;Short Hair;Big Dick;Booty Shorts;Jean Shorts;Tank Top;Big Ass;Curvy Woman;Thick;Black;Black Hair;High Heels;Bald Pussy;Innie Pussy;Big Naturals;Huge Tits;Big Boobs (Natural);Natural Tits;Sex;Creampie;Pussy Creampie;Masturbation;Blowjob;Blowjob - POV;Indoors;Living Room;Amateur;Big Tits Worship;Cowgirl;Doggystyle;Missionary;Missionary - POV;Side Fuck;Side Fuck - POV;Dildo;Sex Toys;4k", "sub_side": "Big Tit Cream Pie"},
{"url": "https://bangbros.com/video/9450711/i-need-to-practice-on-a-big-dick", "title": "I Need To Practice On A Big Dick", "release_date": "November 5, 2023", "performers": "Jessica Marie, Jovan Jordan", "synopsis": "Jessica Marie is facing some heartbreak after her late boyfriend has just dumped her because her pussy wasnt wet enough or ready to take big dick the offers on the table and her boyfriend had just that. Her new stepdad Jovan Jordan is willing to help her practice through the process and stretchs her pussy out so that it may be easier to take bigger dick elsewhere.", "tags": "Tattoo;Muscular Man;Black Male;Black Hair;Short Hair;Stepdad;Big Dick;Glasses;Jean Shorts;Small Ass;Teen18+;Piercing;Petite;Caucasian;Red Head;Stepdaughter;Hairy Pussy;Innie Pussy;Small Tits;Natural Tits;Sex;Cum Shot;Facial;Handjob;Blowjob;Indoors;Living Room;Amateur;Big Dick Worship;cheating;Couples Fantasies;Interracial;Cowgirl;Doggystyle;Missionary;Reverse Cowgirl;Stand And Carry;4k", "sub_side": "BangBros 18"},
{"url": "https://bangbros.com/video/9497071/kelsey-kane-gets-a-deep-inspection", "title": "Kelsey Kane Gets A Deep Inspection", "release_date": "November 7, 2023", "performers": "Kelsey Kane, Jovan Jordan", "synopsis": "On her way to the gym Kelsey's car wont start. She tries to get the aid of her step dad Jovan to help her, at the least come take a look at it. Javon declares he is too busy and she need to find any other means but him. Not taking no for an answer, and realizing he is not blind to how insanely hot she is, she put a plan into motion. He may have been strong enough to say no to her ass in her biker shorts, but bare ass and oiled up is a different story. Suddenly Javon has all the time in the world. First things first he need to faceplant in her ass. Then after she takes his massive dick down the back of her throat, he fucks her like she had been begging for. He leaves her face plastered in cum. They fucked each other brains out. I don't think either of them remembered her car was not working.", "tags": "Muscular Man;Black Male;Black Hair;Short Hair;Stepdad;Big Dick;Sports Bra;Bubble Butt;Woman (20-29);Piercing;Tattoo;Athletic;Caucasian;Blonde;Stepdaughter;Bald Pussy;Innie Pussy;Medium Tits;Natural Tits;Sex;Cumshot Clean-Up;Cum Shot;Facial;Wet;Ass Licking;Blowjob;Blowjob - POV;Deep Throat;Face Fuck;Gagging;Pussy Fingering;Pussy Licking;Spanking;Bathroom;Indoors;Amateur;Ass Worship;cheating;Couples Fantasies;Interracial;Cowgirl;Doggystyle;Doggystyle - Standing;Missionary;Missionary - POV;Reverse Cowgirl;Side Fuck;Stand And Carry;Oil;4k", "sub_side": "Bangbros Clips"},
{"url": "https://bangbros.com/video/9509961/addisons-perfect-gift-for-johnny", "title": "Addison's Perfect Gift For Johnny", "release_date": "November 8, 2023", "performers": "Addison Vodka, Johnny Love", "synopsis": "So we are cruising around for Johnnys birthday, trying to find something to get into. We pull up on this gorgeous Blonde Addison, with such a tight body. After we get the initial creepiness out of the way, we get down to business. We offer her $1000 dollars for her panties. Reluctant at first she gets on the bus and gives them to Johnny who we offer 500 to put them on. Johnny always the clown makes everyone laugh at his awkwardness. We offer her some more money to just get fully naked. Then she joins Johnny in the naked awkwardness reminiscent of the ending scene of the graduate. We find out she hasn’t had sex in a while and thought this would be the perfect gift for Johnny. We ask her could he eat her pussy and it actually was the fastest yes of the day. Johnny goes down on her and his dick gets rock hard. You should see the way Johnny faces lights up when she asks can she suck it. Suck it she does. Johnny fucks her like her sexy gorgeous ass deserves to be fucked. She cums so much we have to give her a moment at the end. Johnny covers her tight body in a massive load. This had to be the best birthday gift. You are welcome Johnny.", "tags": "Average Male Body ;Latin;Black Hair;Short Hair;Big Dick;Dress;Big Ass;Bubble Butt;Piercing;Tattoo;Athletic;Caucasian;Brunette;Trimmed Pussy;Innie Pussy;Small Tits;Natural Tits;One-on-One;Sex;Cum Shot;Facial;Handjob;Kissing;Blowjob;Deep Throat;Gagging;Pussy Licking;Spanking;Spitting;Car;Outdoors;Amateur;Interracial;Cowgirl;Doggystyle;Missionary;Reverse Cowgirl;Side Fuck;4k", "sub_side": "Bang Bus"},
{"url": "https://bangbros.com/video/9502351/anal-in-the-park", "title": "Anal in the Park", "release_date": "November 10, 2023", "performers": "Saba Lapiedra, Tommy Cabrio", "synopsis": "Saba Lapiedra was stretching in the park when Tommy Cabrio came along and asked her if she could teach him some exercises. She liked him so gladly she did. As they were exercising together they got even closer and decided to move to a less crowded area. Here quickly she started to suck his cock and they started to fuck. At some point Tommy decided to fuck her in the ass so he pulled his dick out of her pussy and squeezed it into her tiny asshole. He kept fucking her. She sucked him some more and then he came into her mouth and her face.", "tags": "Slim;European;Brown Hair;Short Hair;Big Dick;Leggings;Sports Bra;Big Ass;Bubble Butt;Tattoo;Black Hair;Bald Pussy;Outie Pussy;Small Tits;Natural Tits;Sex;Cum Shot;Facial;Handjob;Kissing;Anal Fingering;Ass To Mouth;Blowjob;Blowjob - POV;Deep Throat;Face Fuck;Gagging;Spanking;Gym;Outdoors;Amateur;Anal;Ballerina;Cowgirl;Doggystyle;Doggystyle - POV;Doggystyle - Standing;Side Fuck;Spoon;Outdoor Sex;4k", "sub_side": "Public Bang"},
{"url": "https://bangbros.com/video/9497411/stretching-out-august", "title": "Stretching Out August", "release_date": "November 9, 2023", "performers": "August Skye, Sheem the Dream", "synopsis": "When August Sky's trainer Sheem comes over, it starts out like a normal session. August complains that their last session left her a little tight, so Sheem says for this one they can stretch her out a little. Its gets really hot and August needs to take off her sports bra. They continue to stretch and August notices a bulge in Sheem's sweatpants. She is so apologetic, because she knows it must be hard for him, literally, to not get hard with all the touching and rubbing with her top off. She feels bad and doesn't want him to get blue balls, so she offers him an old fashion so he can release the tension. As she caresses his large cock, she starts to feel a little tension in her lower area. Sheem assures her he is good at relieving tension as well, He dives deep into her pussy and the real workout begins. He bangs her pussy loose, fucking all the stress out of her, and she empties his balls relieving his. She is down for the new routine and can't wait for the next session and the next load.", "tags": "Leggings;Sports Bra;Big Ass;Bubble Butt;Average Body;Black;Black Hair;Yoga;Trimmed Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Handjob;Wet;Blowjob;Deep Throat;Hair Pulling;Pussy Fingering;Pussy Licking;Spanking;Indoors;Living Room;Amateur;Ass Worship;Big Tits Worship;Work Fantasies;Cowgirl;Doggystyle;Doggystyle - Lying;Doggystyle - Standing;Side Fuck;Oil;4k", "sub_side": "Brown Bunnies"},
{"url": "https://bangbros.com/video/9496911/caught-ass-handed", "title": "Caught Ass Handed", "release_date": "November 6, 2023", "performers": "Gem Jewels, Peter Green", "synopsis": "Peter Green catches his step sister shaking her ass for the camera and Gem Jewels catches her stepbrother jacking of his dick to her shaking said ass. ooo seems like a catch 22 only way to solve this is to finish what you started seperately, together! Peter finished filming for his sister and she sucks and fucks him like she should what an epic exchange.", "tags": "Muscular Man;American Man;Short Hair;Step-brother;Big Dick;Booty Shorts;Jean Shorts;Tank Top;Big Ass;Bubble Butt;Thick;Voluptuous;Latina;Black Hair;Stepsister;Thong;Innie Pussy;Big Naturals;Big Tits;Big Boobs (Natural);Natural Tits;Sex;Cumshot Clean-Up;Cum Shot;Facial;Twerking;Wet;Blowjob;Blowjob - POV;Face Sitting;Pussy Licking;Spanking;Indoors;Living Room;Amateur;Ass Worship;Interracial;Cowgirl;Doggystyle;Doggystyle - POV;Reverse Cowgirl;Reverse Cowgirl - POV;Side Fuck;Spoon;Oil;4k", "sub_side": "Ass Parade"},
{"url": "https://bangbros.com/video/9502671/mandys-mouthwatering-booty", "title": "Mandy’s Mouthwatering Booty", "release_date": "November 13, 2023", "performers": "Mandy Waters, Jovan Jordan", "synopsis": "This week we met up with Mandy Waters to have a bit of fun. First we chill by the pool where she displays her wonderful attributes for us. then we move inside to oil her booty up and have that thing sparkling just in time for our boy Jovan Jordan to join in on the fun. He has some fun playing with her booty and then it’s time to get to work. Mandy slowly peels his shorts to reveal his massive cock. From there, it’s only a matter of time before she’s choking on his huge monster cock. Soon, she begs for him to stretch her tight hole. Her wishes became true when he shoved his cock in and out of her pussy making her scream with pleasure. All this leading to huge load all over her face.", "tags": "Average Male Body ;Black Male;Black Hair;Short Hair;Big Dick;Bikini;Big Ass;Bubble Butt;Tattoo;Athletic;Caucasian;Red Head;High Heels;Trimmed Pussy;Outie Pussy;Small Tits;Natural Tits;Sex;Cumshot Clean-Up;Cum Shot;Facial;Twerking;Wet;Ass Licking;Blowjob;Deep Throat;Spanking;Indoors;Outdoors;Pool;Amateur;Ass Worship;Interracial;Cowgirl;Doggystyle;Reverse Cowgirl;Side Fuck;Stand And Carry;Oil;4k", "sub_side": "Ass Parade"},
{"url": "https://bangbros.com/video/9297841/ive-been-asking-for-you", "title": "I've been asking for you", "release_date": "November 12, 2023", "performers": "Ria Sunn, Freddy Gong", "synopsis": "Ms. Ria Sunn has been craving some Freddy Gong and today is finally the day she gets him. Bangbros is always happy to supply big dick pleasure to our associates wherever they may be Freddy Gong recognize her pussy smell right away and is immediately ready to pump dick into her and Ria is instantly ready to take it.", "tags": "Average Male Body ;Black Male;Black Hair;Long;Big Dick;Dress;Small Ass;Woman (20-29);Tattoo;Athletic;Czech;Blonde;Thong;Bald Pussy;Outie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Ass Licking;Ass To Mouth;Blowjob;Blowjob - POV;Deep Throat;Face Fuck;Gagging;Pussy Fingering;Pussy Licking;Spanking;Indoors;Living Room;Amateur;Anal;Interracial;Cowgirl;Cowgirl - POV;Doggystyle;Doggystyle - Standing;Missionary;Reverse Cowgirl;Side Fuck;Spoon;4k", "sub_side": "Monsters of Cock"},
{"url": "https://bangbros.com/video/9514371/i-may-lose-my-job-but-fuck-me", "title": "I May Lose My Job but Fuck Me", "release_date": "November 16, 2023", "performers": "Lola Rose, Johnny Love", "synopsis": "Lola Rose has come to clean! Johnny Loves to watch women clean naked ever since his girl and him parted ways. Lola is reluctant at first but you know money talks! Johnny offers a hefty some to see titties bounce while she wipes away all the germs from the existence of the planet. Before Long Johnny and Lola have tickled the erotic fantasy of hired maid fucks employer and instead of holding off the inevitable they embrace and can you say plot twist? this wont be your typical rodeo AT ALL.", "tags": "Average Male Body ;Latin;Big Dick;Jean Shorts;Tank Top;Small Ass;Tattoo;Athletic;Latina;Brunette;Maid;Thong;Trimmed Pussy;Outie Pussy;Small Tits;Natural Tits;Sex;Cumshot Clean-Up;Cum Shot;Facial;Cleaning;Blowjob;Indoors;Living Room;Amateur;Anal;Work Fantasies;Cowgirl;Doggystyle;Missionary;Missionary - POV;Reverse Cowgirl;4k", "sub_side": "My Dirty Maid"},
{"url": "https://bangbros.com/video/9514341/mind-your-fucking-business", "title": "Mind Your Fucking Business", "release_date": "November 18, 2023", "performers": "Juliana Dreams, Jay Bangher", "synopsis": "Juliana Dreams was taking a shower, soaping her voluptuous breasts. Her Step Bro sneaking to the bathroom door and started to film her on his phone. She kept sensually soaping her body until she noticed him. She closed the door and told him: Mind Your Fucking Business!!! When she got out of the shower, she was oiling her body. Slowly massaging the oil into her big tits. Again she noticed Jay filming her. Again she slammed the door and asked him to mind his business. Jay had enough material. He went to the bathroom to jack off to the videos he filmed. The door flew open, Juliana stormed in. Grabbed his phone and told him. We need to get this out of your system. She pressed his face against her breasts and started to motorboat him. Then she sucked his dick and they fucked in the bedroom until Jay creampied her.", "tags": "Muscular Man;Black Male;Brown Hair;Long;Big Dick;Bikini;Big Ass;Tattoo;Thick;Voluptuous;Black;Latina;Black Hair;Trimmed Pussy;Innie Pussy;Big Naturals;Big Tits;Big Boobs (Natural);Natural Tits;Creampie;Pussy Creampie;Voyeur;Washing;Wet;Blowjob;Blowjob - POV;Spanking;Titty Fuck;Tittyfuck - POV;Bathroom;Bedroom;Indoors;Shower;Amateur;Big Tits Worship;Cowgirl;Doggystyle;Doggystyle - POV;Reverse Cowgirl;Side Fuck;Oil;Soap;4k", "sub_side": "Big Tit Cream Pie"},
{"url": "https://bangbros.com/video/9502591/spying-on-big-boobs", "title": "Spying on Big Boobs", "release_date": "November 11, 2023", "performers": "Lily Lou, Damion Dayski", "synopsis": "Description: Lily Lou is getting ready to take a shower, little does she know that she is about to be spied on by Damion Dayski. She gets inside and starts lathering all over her giant boobs and big ass. Within no time, Damion comes in and starts peeking. Eventually he gets caught and starts running away from her. A chase ensues until eventually he falls to the bed and she notices how big his dick is. Her attitude changes, gets close to him and tells him she can help him out, and doesn't want him to get blue balls. From there, she begins to suck on his giant cock and then gets banged really hard from all positions until he cums all over her face.", "tags": "Piercing;Tattoo;Muscular Man;Black Male;Black Hair;Short Hair;Big Dick;Bikini;Big Ass;Bubble Butt;Woman (20-29);Athletic;Trimmed Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cum Shot;Facial;Voyeur;Washing;Wet;Blowjob;Hair Pulling;Pussy Fingering;Pussy Licking;Bathroom;Bedroom;Indoors;Amateur;Big Dick Worship;Big Tits Worship;Interracial;Cowgirl;Cowgirl - POV;Doggystyle;Doggystyle - Lying;Missionary;Side Fuck;Spoon;Oil;Soap;4k", "sub_side": "Big Tits, Round Asses"},
{"url": "https://bangbros.com/video/9514281/blonde-pussy-joyride", "title": "Blonde Pussy Joyride", "release_date": "November 15, 2023", "performers": "JoJo Austin, Parker Sims", "synopsis": "Jojo Austin is a fresh face ready to show off what she can do. We have a new guy Parker Sims also eager to show us how he can fuck. We find Jojo walking down the street and with our boy in the bus, we knew we would have some fun. After showing off some of our cash, Jojo climbed in the back of the Bang Bus. She shows off her perky tits and takes off her underwater so we can take a good look at her tight pussy. We couldn't wait any longer so we had Parker go down on Jojo until she was ready to get dicked down. And she definitely got dicked down. Watch Jojo Austin get thrown around and fucked in positions she's never done before. To be able to release my load while squeezing her tits is a dream.", "tags": "Jean Shorts;Tank Top;Small Ass;Teen18+;Petite;Caucasian;Blonde;Bald Pussy;Outie Pussy;Small Tits;Natural Tits;Tattoo;Slim;American Man;Short Hair;Average Dick;Sex;Cum Shot;Facial;Handjob;Blowjob;Pussy Licking;Car;Outdoors;Amateur;Cowgirl;Doggystyle;Reverse Cowgirl;Side Fuck;Spoon;4k", "sub_side": "Bang Bus"},
{"url": "https://bangbros.com/video/9514401/dirty-maid-tempted-by-big-dick", "title": "Dirty Maid Tempted by Big Dick", "release_date": "November 17, 2023", "performers": "Gigi Dior, Johnny Love", "synopsis": "I just love dirty, dirty maids. Especially those with thick dick sucking lips. Isabella Angelina is another story though, her lips can suck off all the cum in your cock. She's a maid working for Freddy Gong and she can really get on her knees to clean some dirt. He has her clean his house before he asks if she can remove some of her clothes. She was reluncant at first but after seeing the money Freddy was offering, she knew she couldn't say no. Slowly but surely we get to see all her curves and her nice bubble butt. It wasn't too long before Freddy suprised her with his cock. Once he offered a lot of money, Isabella was ready to deep throat. Isabella's body look insanely attractive when she's bounding up and down on a hard cock. If she isn't your favorite then you're missing out!", "tags": "Average Male Body ;Latin;Black Hair;Short Hair;Big Dick;Bubble Butt;MILF;Athletic;Caucasian;Blonde;High Heels;Thong;Trimmed Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Massage;Squirt;Wet;Blowjob;Blowjob - POV;Face Fuck;Gagging;Pussy Fingering;Indoors;Kitchen;Living Room;Amateur;Ass Worship;Big Tits Worship;Interracial;Ballerina;Cowgirl;Doggystyle;Doggystyle - POV;Doggystyle - Standing;Missionary;Missionary - POV;Reverse Cowgirl;Slow Dance;Oil;4k", "sub_side": "MomIsHorny"},
{"url": "https://bangbros.com/video/9502471/the-bbc-you-need", "title": "The BBC You Need", "release_date": "November 14, 2023", "performers": "Sladyen Skaya, Mr Longwood", "synopsis": "Slayden Skaya couldn't wait to be alone.She has been fantasizing about a big black cock in her ass all week. Soon as her roomate leaves it is on. She starts to stretch her ass out real good with her massive black dildo. Her roomate walks in on her surprising her. She explains her obsession with a BBC in her asshole, and he lets her know he is more than willing to help her out. He pulls out his bbc, and she is amazed he has been here for her all this while. She puts it in her mouth with the quickness, and he already knew the assignment. Once good and hard he started to pound her ass with it. He fucked her in her ass and filled her to capacity. He came all over her face then assured her she won't be needing her dildo anymore because he will always be available for her.", "tags": "Muscular Man;Black Male;Big Dick;Bubble Butt;Teen18+;Piercing;Tattoo;Athletic;Euro;Blonde;High Heels;Thong;Trimmed Pussy;Innie Pussy;Big Tits;Enhanced;Sex;Cumshot Clean-Up;Cum Shot;Facial;Masturbation;Wet;Blowjob;Blowjob - POV;Deep Throat;Face Fuck;Gagging;Gaping;Spanking;Indoors;Living Room;Amateur;Anal;Interracial;POV;Cowgirl;Cowgirl - POV;Doggystyle;Doggystyle - POV;Missionary;Missionary - POV;Reverse Cowgirl;Reverse Cowgirl - POV;Side Fuck;Anal Toys;Dildo;Oil;Sex Toys;4k", "sub_side": "Bang POV"}
]