[
    {
        "Action": "Bald LezOnly\nBald LezOnly",
        "Alias": "",
        "Data18Link": "https://www.data18.com/scenes/1175663",
        "Dauer": "00:43:55",
        "IAFDLink": "https://www.iafd.com/title.rme/title=extra+tall+babe+vs+extra+small+spinner/year=2017/extra-tall-babe-vs-extra-small-spinner.htm",
        "ID": 71,
        "Movies": "Scene 4: TeamSkeet - The Alpha Female 1(2018)FULLHD-ENGLISH",
        "Performers": "Alice Merchesi\nLauren Phillips",
        "ProductionDate": "",
        "Regie": "",
        "ReleaseDate": "2017:03:23 00:00:00",
        "SceneCode": "",
        "Serie": "Exxxtra Small",
        "Synopsis": "Petite treat Alice Merchesi is on the phone telling a friend she doesn\"t care that the guy she is fucking has a girlfriend. She hears a banging on her door and answers it to find the angry Lauren Phillips who barges right in. Lauren is a much bigger redhead with a banging curvy body. The problem is she is pissed off at Alice for fucking her man. Alice, being much smaller but so exquisitely sexy is immediately pushed to her knees and is made to crawl up the stairs while Lauren tells her she\"s a whore as she crawls to the bedroom. Lauren sits on the bed while Alice tries to protest but has her sweater vest unzipped with her bouncy b cup tits plopping right out. Lauren tells Alice if she\"s fucking her man that she had better show her what she\"s got. Alice is flustered and upset by this though it doesn\"t stop Lauren from making her strip totally naked. Lauren has this tiny brunette spread out on her back and unhappy. Lauren then pokes her pink snatch and grabs her boobs. Lauren starts undressing while demanding the smaller Alice stay laying spread eagle while playing with herself. Lauren shows off her nice ass and huge tits while stripping out of a skirt and stockings. She starts telling Alice she\"s going to fuck her and that her little tits next to her huge ones will be hot. Alice is protesting, but it\"s not going to work. She gets manhandled by Lauren who grabs her by the legs and pulls her across the bed. She gets roughed up, picked up, spun around, spanked, and tossed around like a little elf in what turns out to be a great nude wrestling match that Alice stands no chance of winning. Finally, Lauren breaks out a strap on and starts fucking the out of Alice with it. Lauren is not gentle about how she penetrates little Alice. Rather, Lauren fucks her like a dog from behind, drills her while her knee is on her head, and spreads her wide open for some rough missionary. All the while Alice is kind of enjoying it and kind of moaning in pain. This is some serious destruction of tiny pussy that is not to be missed. ",
        "Tags": "69;Amateur;Bed;Big Tits;Caucasian;Cute;Fingering;Fondling;Girl / Girl;Hardcore;High Heels;Indoor;Lesbian;Long Hair;Naked;Natural Tits;Pantyless;PAWG;Pussy Licking;Redhead;Rough Sex;Shaved Pussy;Short;Strap on;Teen;Tiny;Toned;Toys;Viral;White;Wild",
        "ThePornDB": "https://api.theporndb.net/scenes/1075cb44-e624-40be-8947-457b80cc248e",
        "Titel": "Extra Tall Babe Vs Extra Small Spinner",
        "WebSideLink": "https://www.teamskeet.com/movies/extra-tall-babe-vs-extra-small-spinner"
    }
]